tap "acrogenesis/macchanger"
tap "bazelbuild/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "mdogan/zulu"
tap "withgraphite/tap"
brew "xz"
brew "bat"
brew "bazelisk"
brew "bottom"
brew "broot"
brew "bzip2"
brew "glib"
brew "daemontools"
brew "docker", link: false
brew "docker-compose"
brew "dockutil"
brew "exa"
brew "fd"
brew "gawk"
brew "gh"
brew "git"
brew "git-town"
brew "htop"
brew "python@3.10"
brew "httpie"
brew "hyperfine"
brew "jid"
brew "jq"
brew "just"
brew "lazygit"
brew "libfido2"
brew "libidn2"
brew "python@3.9"
brew "luv"
brew "mas"
brew "mysql"
brew "neovim"
brew "openjdk"
brew "openssl@3"
brew "putty"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rename"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "spotify-tui"
brew "swiftformat"
brew "tailscale"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "volta"
brew "wget"
brew "wifi-password"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "acrogenesis/macchanger/macchanger"
brew "withgraphite/tap/graphite"
cask "alfred"
cask "alt-tab"
cask "android-ndk"
cask "android-sdk"
cask "android-studio"
cask "apparency"
cask "coconutbattery"
cask "datagrip"
cask "discord"
cask "docker"
cask "figma"
cask "flutter"
cask "flux"
cask "font-agave-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "fork"
cask "gather"
cask "intellij-idea"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kitty"
cask "linear-linear"
cask "logseq"
cask "notion"
cask "notion-enhanced"
cask "postman"
cask "private-internet-access"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "rectangle"
cask "slack"
cask "spotify"
cask "suspicious-package"
cask "visual-studio-code"
cask "zoom"
cask "zulu-jdk17"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "forScore", id: 363738376
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
