tap "acrogenesis/macchanger"
tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "bazelbuild/tap"
tap "homebrew/command-not-found"
tap "hookdeck/hookdeck"
tap "mdogan/zulu"
tap "oven-sh/bun"
tap "withgraphite/tap"
tap "zkondor/dist"
brew "aichat"
brew "giflib"
brew "libpng"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "glib"
brew "libxext"
brew "atuin"
brew "libgit2"
brew "bat"
brew "bazelisk"
brew "bottom"
brew "broot"
brew "btop"
brew "bzip2"
brew "cairo"
brew "libidn2"
brew "unbound"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "librist"
brew "libsamplerate"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "chromaprint"
brew "cloudflared"
brew "cocoapods"
brew "daemontools"
brew "dasel"
brew "docker", link: false
brew "docker-compose"
brew "dockutil"
brew "eigen"
brew "eza"
brew "fastlane"
brew "fd"
brew "gcc"
brew "fftw"
brew "flyctl"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "httpie"
brew "hyperfine"
brew "ios-deploy"
brew "jid"
brew "jpeg"
brew "jq"
brew "libfido2"
brew "librsvg"
brew "luv"
brew "mas"
brew "mise"
brew "mysql"
brew "neovim"
brew "pdm"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "postgresql@15"
brew "putty"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "rclone"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rustup"
brew "scons"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "taglib"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "trunk"
brew "uv"
brew "wget"
brew "yaml-cpp"
brew "zellij"
brew "zoxide"
brew "acrogenesis/macchanger/macchanger"
brew "oven-sh/bun/bun"
brew "withgraphite/tap/graphite"
cask "1password"
cask "1password-cli"
cask "amie"
cask "apparency"
cask "arc"
cask "cleanshot"
cask "clop"
cask "coconutbattery"
cask "container"
cask "cursor"
cask "datagrip"
cask "discord"
cask "figma"
cask "flux-app"
cask "font-agave-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "linear-linear"
cask "logseq"
cask "messenger"
cask "mimestream"
cask "notion"
cask "postico"
cask "postman"
cask "qlmarkdown"
cask "raycast"
cask "rectangle"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "syntax-highlight"
cask "temurin@17"
cask "visual-studio-code"
cask "warp"
cask "webstorm"
cask "wezterm"
cask "zen"
cask "znotch"
cask "zoom"
cask "zulu-jdk17"
cask "zulu@17"
mas "KakaoTalk", id: 869223134
mas "TestFlight", id: 899247664
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "adonisjs.vscode-edge"
vscode "andrejunges.handlebars"
vscode "antfu.iconify"
vscode "bierner.color-info"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chrisbibby.hide-node-modules"
vscode "cipchk.cssrem"
vscode "codezombiech.gitignore"
vscode "dakshmiglani.hex-to-rgba"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-rename-tag"
vscode "fractalbrew.backticks"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "ionutvmi.path-autocomplete"
vscode "irongeek.vscode-env"
vscode "jripouteau.adonis-vscode-extension"
vscode "jripouteau.japa-vscode"
vscode "jsynowiec.vscode-insertdatestring"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "letrieu.expand-region"
vscode "mechatroner.rainbow-csv"
vscode "meouwu.css-var-color-decorator"
vscode "micnil.vscode-checkpoints"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.powershell"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.wasm-dwarf-debugging"
vscode "naumovs.color-highlight"
vscode "nicholashsiang.vscode-react-snippet"
vscode "nomicfoundation.hardhat-solidity"
vscode "nortakales.date-hover-preview"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "planbcoding.vscode-react-refactor"
vscode "prisma.prisma"
vscode "pusnow.hwp"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sburg.vscode-javascript-booster"
vscode "selemondev.vscode-shadcn-svelte"
vscode "serayuzgur.crates"
vscode "shopify.theme-check-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "suhelmakkad.shadcn-ui"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tgreen7.css-to-js"
vscode "thomascsd.vscode-readme-pattern"
vscode "thqby.vscode-autohotkey2-lsp"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vunguyentuan.vscode-postcss"
vscode "wallabyjs.console-ninja"
vscode "whizkydee.material-palenight-theme"
vscode "wmaurer.change-case"
vscode "wware.snippet-creator"
vscode "yandeu.five-server"
vscode "yoavbls.pretty-ts-errors"
vscode "yuzu.snippets-next-13"
vscode "yzhang.markdown-all-in-one"
vscode "zardoy.ts-essential-plugins"
vscode "ziyasal.vscode-open-in-github"
