tap "acrogenesis/macchanger"
tap "bazelbuild/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "mdogan/zulu"
tap "withgraphite/tap"
tap "zkondor/dist"
brew "aichat"
brew "libgit2"
brew "bat"
brew "bazelisk"
brew "bottom"
brew "broot"
brew "btop"
brew "bzip2"
brew "python@3.12"
brew "glib"
brew "libxext"
brew "cairo"
brew "daemontools"
brew "docker", link: false
brew "docker-compose"
brew "dockutil"
brew "eza"
brew "fd"
brew "libidn2"
brew "harfbuzz"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "httpie"
brew "hyperfine"
brew "jid"
brew "jq"
brew "libfido2"
brew "luv"
brew "mas"
brew "mise"
brew "mysql"
brew "neovim"
brew "openjdk"
brew "postgresql@15", restart_service: true
brew "putty"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "redis", restart_service: true
brew "rename"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "wifi-password"
brew "zellij"
brew "zoxide"
brew "acrogenesis/macchanger/macchanger"
brew "withgraphite/tap/graphite"
cask "apparency"
cask "arc"
cask "coconutbattery"
cask "datagrip"
cask "discord"
cask "docker"
cask "figma"
cask "flux"
cask "font-agave-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "linear-linear"
cask "logseq"
cask "messenger"
cask "mimestream"
cask "notion"
cask "postico"
cask "postman"
cask "qlmarkdown"
cask "raycast"
cask "rectangle"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "syntax-highlight"
cask "visual-studio-code"
cask "warp"
cask "znotch"
cask "zoom"
cask "zulu-jdk17"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Endel", id: 1346247457
mas "forScore", id: 363738376
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Medis", id: 1579200037
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
vscode "aaron-bond.better-comments"
vscode "andrejunges.handlebars"
vscode "antfu.iconify"
vscode "bierner.color-info"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chrisbibby.hide-node-modules"
vscode "cipchk.cssrem"
vscode "codezombiech.gitignore"
vscode "dakshmiglani.hex-to-rgba"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "doublebot.doublebot"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "fractalbrew.backticks"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "ionutvmi.path-autocomplete"
vscode "irongeek.vscode-env"
vscode "jsynowiec.vscode-insertdatestring"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "letrieu.expand-region"
vscode "mechatroner.rainbow-csv"
vscode "micnil.vscode-checkpoints"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.test-adapter-converter"
vscode "naumovs.color-highlight"
vscode "nicholashsiang.vscode-react-snippet"
vscode "nomicfoundation.hardhat-solidity"
vscode "nortakales.date-hover-preview"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "prisma.prisma"
vscode "pusnow.hwp"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sburg.vscode-javascript-booster"
vscode "sourcegraph.cody-ai"
vscode "streetsidesoftware.code-spell-checker"
vscode "suhelmakkad.shadcn-ui"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tgreen7.css-to-js"
vscode "thomascsd.vscode-readme-pattern"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "vunguyentuan.vscode-postcss"
vscode "wallabyjs.console-ninja"
vscode "whizkydee.material-palenight-theme"
vscode "wmaurer.change-case"
vscode "wware.snippet-creator"
vscode "yuzu.snippets-next-13"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
